

&НаКлиенте
Процедура ЗаполнитьГрафикПлатежей(Команда)
	ЗаполнитьГрафикПлатежейНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьГрафикПлатежейНаСервере()

	Объект.ГрафикПлатежей.Очистить();
	
	НачалоПериода 	= ДобавитьМесяц(Объект.ДатаНачала, 1);
	КонецПериода 	= Объект.ДатаОкончания;
	
	ДеньМесяца = День(Объект.ДатаНачала);
	
	Пока НачалоПериода <= КонецПериода Цикл
		Стр = Объект.ГрафикПлатежей.Добавить();
		Стр.ДатаПлатежа = НачалоПериода;
		Стр.Проценты	= (Объект.Сумма + Объект.ГрафикПлатежей.Итог("Сумма") + Объект.ГрафикПлатежей.Итог("Проценты")) * (Объект.ПроцентнаяСтавка/100/12); 
		Стр.Сумма 		= Объект.ЕжемесячноеПополнение;
		НачалоПериода 	= ДобавитьМесяц(НачалоПериода, 1);	
	КонецЦикла;
	
КонецПроцедуры
