&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаНачала = НачалоДня(ТекущаяДата());
	ГраницаПоУмолчанию = ЛФПСервер.ГраницаПланированияПоУмолчанию();
	Если ГраницаПоУмолчанию <> Неопределено Тогда
		ДатаОкончания = ГраницаПоУмолчанию;
	Иначе
		ДатаОкончания = КонецГода(ДобавитьМесяц(ТекущаяДата(), 12));
	КонецЕсли;
	ЗаполнитьКалендарьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьКалендарьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()
	ЛФПСервер.ЗаполнитьПлатежныйКалендарь(ДатаНачала, ДатаОкончания, ТаблицаОпераций, ТаблицаПоСтатьям);
КонецПроцедуры
