&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФильтрПользователь = ЛФПСервер.ТекущийПользователь();
	Заголовок = Строка(ФильтрПользователь);
	ЗаполнитьВсеДиаграммы();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПользовательПриИзменении(Элемент)
	ЗаполнитьВсеДиаграммы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеДиаграммы()
	Если ЗначениеЗаполнено(ФильтрПользователь) Тогда
		ЛФПСервер.ЗаполнитьДиаграммуЖизненныйПусть(ФильтрПользователь, ДиаграммаЖизненныйПуть);
	КонецЕсли;
	ЛФПСервер.ЗаполнитьДиаграммуЦели(ДиаграммаЦели);
	ЛФПСервер.ЗаполнитьДиаграммуДостиженияЦелей(ДиаграммаДостижениеЦелей);
	ЛФПСервер.ЗаполнитьДиаграммуДоходыРасходы(ДиаграммаДоходыРасходыПлан);
КонецПроцедуры
