&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФильтрПользователь = Справочники.Пользователи.НайтиПоНаименованию("Шибанов Алексей Николаевич");
	Заголовок = Строка(ФильтрПользователь);
	ЗаполнитьДиаграммуЖизненныйПусть();
	ЗаполнитьДиаграммуЦели();
	ЗаполнитьДиаграммуДостиженияЦелей();
	ЗаполнитьДиаграммуДоходыРасходы();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПользовательПриИзменении(Элемент)
	//ЗаполнитьДиаграмму();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДиаграммуЖизненныйПусть()

	ДиаграммаЖизненныйПуть.Очистить();
	
	ДиаграммаЖизненныйПуть.УстановитьПолныйИнтервал(ФильтрПользователь.ДатаРождения, ФильтрПользователь.ДатаДожития);
	
	ПоследнийДР = Дата(Год(ТекущаяДата()), Месяц(ФильтрПользователь.ДатаРождения), День(ФильтрПользователь.ДатаРождения)); 
	Если ПоследнийДР > ТекущаяДата() Тогда
		ПоследнийДР = ДобавитьМесяц(ПоследнийДР, -12);
	КонецЕсли;
	КолВоЛет = Год(ПоследнийДР) - Год(ФильтрПользователь.ДатаРождения);
	
	Точка 	= ДиаграммаЖизненныйПуть.УстановитьТочку("_");
	Серия	= ДиаграммаЖизненныйПуть.УстановитьСерию("Пройденный жизненный путь");
	
	Значение = ДиаграммаЖизненныйПуть.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало 		= ФильтрПользователь.ДатаРождения;
	Интервал.Конец 			= ТекущаяДата();
	Интервал.Текст			= "Пройденный жизненный путь: " + Формат(КолВоЛет, "ЧДЦ=0");
	
	Серия	= ДиаграммаЖизненныйПуть.УстановитьСерию("Период");
	
	ПоследнийДР = Дата(Год(ФильтрПользователь.ДатаНачалаАктивногоИнвестирования), Месяц(ФильтрПользователь.ДатаРождения), День(ФильтрПользователь.ДатаРождения)); 
	Если ПоследнийДР > ФильтрПользователь.ДатаНачалаАктивногоИнвестирования Тогда
		ПоследнийДР = ДобавитьМесяц(ПоследнийДР, -12);
	КонецЕсли;
	КолВоЛетБезИнвестирования = Год(ПоследнийДР) - Год(ФильтрПользователь.ДатаРождения);
	
	ПоследнийДР = Дата(Год(ФильтрПользователь.ДатаПереходаНаПассивныйДоход), Месяц(ФильтрПользователь.ДатаРождения), День(ФильтрПользователь.ДатаРождения)); 
	Если ПоследнийДР > ФильтрПользователь.ДатаПереходаНаПассивныйДоход Тогда
		ПоследнийДР = ДобавитьМесяц(ПоследнийДР, -12);
	КонецЕсли;
	КолВоЛетИнвестирования = Год(ПоследнийДР) - Год(ФильтрПользователь.ДатаРождения) - КолВоЛетБезИнвестирования;
	
	ПоследнийДР = Дата(Год(ФильтрПользователь.ДатаДожития), Месяц(ФильтрПользователь.ДатаРождения), День(ФильтрПользователь.ДатаРождения)); 
	Если ПоследнийДР > ФильтрПользователь.ДатаДожития Тогда
		ПоследнийДР = ДобавитьМесяц(ПоследнийДР, -12);
	КонецЕсли;
	КолВоЛетПассивногоДохода = Год(ПоследнийДР) - Год(ФильтрПользователь.ДатаРождения) - КолВоЛетБезИнвестирования - КолВоЛетИнвестирования;
	
	Значение = ДиаграммаЖизненныйПуть.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало 		= ФильтрПользователь.ДатаРождения;    
	Интервал.Конец 			= ФильтрПользователь.ДатаНачалаАктивногоИнвестирования;
	Интервал.Текст			= "Период без инвестирования: " + Формат(КолВоЛетБезИнвестирования, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(ФильтрПользователь.ДатаРождения, "ДФ=dd.MM.yyyy") + " - " + Формат(ФильтрПользователь.ДатаНачалаАктивногоИнвестирования, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.Красный;

	Значение = ДиаграммаЖизненныйПуть.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало 		= ФильтрПользователь.ДатаНачалаАктивногоИнвестирования;
	Интервал.Конец 			= ФильтрПользователь.ДатаПереходаНаПассивныйДоход;
	Интервал.Текст			= "Период активного инвестирования: " + Формат(КолВоЛетИнвестирования, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(ФильтрПользователь.ДатаНачалаАктивногоИнвестирования, "ДФ=dd.MM.yyyy") + " - " + Формат(ФильтрПользователь.ДатаПереходаНаПассивныйДоход, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.Оранжевый;

	Значение = ДиаграммаЖизненныйПуть.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало 		= ФильтрПользователь.ДатаПереходаНаПассивныйДоход;
	Интервал.Конец 			= ФильтрПользователь.ДатаДожития;
	Интервал.Текст			= "Пассивный доход: " + Формат(КолВоЛетПассивногоДохода, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(ФильтрПользователь.ДатаПереходаНаПассивныйДоход, "ДФ=dd.MM.yyyy") + " - " + Формат(ФильтрПользователь.ДатаДожития, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.ЗеленаяЛужайка;

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДиаграммуЦели()

	ДиаграммаЦели.Очистить();
	
	СерияПлан 			= ДиаграммаЦели.Серии.Добавить("План");
	//СерияПлан.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	//СерияПлан.Маркер	= ТипМаркераДиаграммы.Нет;
	//СерияПлан.Цвет		= WebЦвета.Оранжевый;
	
	СерияФакт 			= ДиаграммаЦели.Серии.Добавить("Факт");
	//СерияПлан.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	//СерияПлан.Маркер	= ТипМаркераДиаграммы.Нет;
	//СерияПлан.Цвет		= WebЦвета.Оранжевый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цели.Ссылка КАК Цель,
	|	Цели.СуммаСИнфляцией КАК СуммаПлан
	|ПОМЕСТИТЬ втЦели
	|ИЗ
	|	Справочник.Цели КАК Цели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотОстатки.Цель КАК Цель,
	|	СУММА(ОборотОстатки.СуммаОстаток) КАК СуммаФакт
	|ПОМЕСТИТЬ втБаланс
	|ИЗ
	|	РегистрНакопления.Оборот.Остатки КАК ОборотОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотОстатки.Цель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЦели.Цель КАК Цель,
	|	втЦели.СуммаПлан КАК СуммаПлан,
	|	ЕСТЬNULL(втБаланс.СуммаФакт, 0) КАК СуммаФакт
	|ИЗ
	|	втЦели КАК втЦели
	|		ЛЕВОЕ СОЕДИНЕНИЕ втБаланс КАК втБаланс
	|		ПО втЦели.Цель = втБаланс.Цель
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаПлан УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Точка = ДиаграммаЦели.УстановитьТочку(Выборка.Цель);
		ДиаграммаЦели.УстановитьЗначение(Точка, СерияФакт, Выборка.СуммаФакт, ,Выборка.СуммаФакт);
		ДиаграммаЦели.УстановитьЗначение(Точка, СерияПлан, Выборка.СуммаПлан, ,Выборка.СуммаПлан);
	КонецЦикла;

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДиаграммуДостиженияЦелей()

	ДиаграммаДостижениеЦелей.Очистить();
	
	СерияЦель 			= ДиаграммаДостижениеЦелей.Серии.Добавить("Цель (сумма)");
	СерияЦель.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияЦель.Маркер	= ТипМаркераДиаграммы.Нет;
	СерияЦель.Цвет		= WebЦвета.Оранжевый;
	
	СерияПлан 			= ДиаграммаДостижениеЦелей.Серии.Добавить("План (сумма)");
	СерияПлан.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияПлан.Маркер	= ТипМаркераДиаграммы.Нет;
	СерияПлан.Цвет		= WebЦвета.Красный;
	
	СерияФакт 			= ДиаграммаДостижениеЦелей.Серии.Добавить("Факт (сумма)");
	СерияФакт.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияФакт.Маркер	= ТипМаркераДиаграммы.Нет;
	СерияФакт.Цвет		= WebЦвета.Зеленый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДостижениеЦелей.Период КАК Период,
		|	СУММА(ДостижениеЦелей.Сумма) КАК СуммаЦель,
		|	0 КАК СуммаПлан
		|ПОМЕСТИТЬ втЦели
		|ИЗ
		|	РегистрСведений.ДостижениеЦелей КАК ДостижениеЦелей
		|
		|СГРУППИРОВАТЬ ПО
		|	ДостижениеЦелей.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДоходностьПоИнвенстициям.Период, МЕСЯЦ),
		|	0,
		|	СУММА(ДоходностьПоИнвенстициям.Пополнение + ДоходностьПоИнвенстициям.Проценты)
		|ИЗ
		|	РегистрСведений.ДоходностьПоИнвенстициям КАК ДоходностьПоИнвенстициям
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ДоходностьПоИнвенстициям.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ втКалендарь
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦели.Период КАК Период,
		|	СУММА(втЦели.СуммаЦель) КАК СуммаЦель,
		|	СУММА(втЦели.СуммаПлан) КАК СуммаПлан
		|ПОМЕСТИТЬ втЦели2
		|ИЗ
		|	втЦели КАК втЦели
		|
		|СГРУППИРОВАТЬ ПО
		|	втЦели.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотОстаткиИОбороты.Период КАК Период,
		|	ОборотОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ОборотОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ОборотОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|	ОборотОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	ОборотОстаткиИОбороты.СуммаРасход КАК СуммаРасход
		|ПОМЕСТИТЬ втФакт
		|ИЗ
		|	РегистрНакопления.Оборот.ОстаткиИОбороты(, , Месяц, , ) КАК ОборотОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКалендарь.Период КАК Период,
		|	ЕСТЬNULL(втЦели2.СуммаЦель, 0) КАК СуммаЦель,
		|	ЕСТЬNULL(втЦели2.СуммаПлан, 0) КАК СуммаПлан,
		|	ЕСТЬNULL(втФакт.СуммаОборот, 0) КАК СуммаФакт
		|ИЗ
		|	втКалендарь КАК втКалендарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦели2 КАК втЦели2
		|		ПО втКалендарь.Период = втЦели2.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ втФакт КАК втФакт
		|		ПО втКалендарь.Период = втФакт.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаЦельНакопительно = 0;
	СуммаПланНакопительно = 0;
	СуммаФактНакопительно = 0;
	Пока Выборка.Следующий() Цикл
		СуммаЦельНакопительно = СуммаЦельНакопительно + Выборка.СуммаЦель;	
		СуммаПланНакопительно = СуммаПланНакопительно + Выборка.СуммаПлан;	
		СуммаФактНакопительно = СуммаФактНакопительно + Выборка.СуммаФакт;	
		Точка = ДиаграммаДостижениеЦелей.УстановитьТочку(Формат(Выборка.Период, "ДФ=ММ.гггг"));
		ДиаграммаДостижениеЦелей.УстановитьЗначение(Точка, СерияЦель, СуммаЦельНакопительно, ,СуммаЦельНакопительно);
		ДиаграммаДостижениеЦелей.УстановитьЗначение(Точка, СерияПлан, СуммаПланНакопительно, ,СуммаПланНакопительно);
		ДиаграммаДостижениеЦелей.УстановитьЗначение(Точка, СерияФакт, СуммаФактНакопительно, ,СуммаФактНакопительно);
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуДоходыРасходы()

	ДиаграммаДоходыРасходыПлан.Очистить();
	
	СерияРасход			= ДиаграммаДоходыРасходыПлан.Серии.Добавить("Расходы (план)");
	СерияРасход.Линия	= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	СерияРасход.Маркер	= ТипМаркераДиаграммы.Нет;
	СерияРасход.Цвет	= WebЦвета.Оранжевый;
	
	//СерияПлан 			= ДиаграммаДостижениеЦелей.Серии.Добавить("План (сумма)");
	//СерияПлан.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	//СерияПлан.Маркер	= ТипМаркераДиаграммы.Нет;
	//СерияПлан.Цвет		= WebЦвета.Красный;
	//
	//СерияФакт 			= ДиаграммаДостижениеЦелей.Серии.Добавить("Факт (сумма)");
	//СерияФакт.Линия		= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	//СерияФакт.Маркер	= ТипМаркераДиаграммы.Нет;
	//СерияФакт.Цвет		= WebЦвета.Зеленый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ втКалендарь
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПлановыеДвижения.Период, МЕСЯЦ) КАК Период,
		|	СУММА(ПлановыеДвижения.Сумма) КАК Расход
		|ПОМЕСТИТЬ втРасходы
		|ИЗ
		|	РегистрНакопления.ПлановыеДвижения КАК ПлановыеДвижения
		|ГДЕ
		|	ПлановыеДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ПлановыеДвижения.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКалендарь.Период КАК Период,
		|	ЕСТЬNULL(втРасходы.Расход, 0) КАК Расход
		|ИЗ
		|	втКалендарь КАК втКалендарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРасходы КАК втРасходы
		|		ПО втКалендарь.Период = втРасходы.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Точка = ДиаграммаДоходыРасходыПлан.УстановитьТочку(Формат(Выборка.Период, "ДФ=ММ.гггг"));
		ДиаграммаДоходыРасходыПлан.УстановитьЗначение(Точка, СерияРасход, Выборка.Расход, ,Выборка.Расход);
	КонецЦикла;

КонецПроцедуры
