
Процедура ЗаполнитьКалендарь() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МИНИМУМ(Пользователи.ДатаРождения) КАК НачалоПериода,
		|	МАКСИМУМ(Пользователи.ДатаДожития) КАК КонецПериода
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	НачалоПериода = Выборка.НачалоПериода;
	КонецПериода = Выборка.КонецПериода;
	
	Пока НачалоПериода <= КонецПериода Цикл
		Запись = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		Запись.ДатаКалендаря = НачалоПериода;
		Запись.Записать();
		НачалоПериода = НачалоПериода + 86400;
	КонецЦикла;
	
КонецПроцедуры
