
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Оборот Приход
	Движения.Оборот.Записывать = Истина;
	Движение = Движения.Оборот.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	Движение.Период 		= Дата;
	Движение.Кошелек 		= Кошелек;
	Движение.Цель 			= Цель;
	Движение.Инвестиция		= Инвестиция;
	Движение.Сумма 			= Сумма;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Баланс <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Инвестиция", Инвестиция);
		Запрос.УстановитьПараметр("Кошелек", Кошелек);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Цель", Цель);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ОборотОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Оборот.Остатки(
		|			&Дата,
		|			Инвестиция = &Инвестиция
		|				И Кошелек = &Кошелек
		|				И Цель = &Цель) КАК ОборотОстатки";
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Сумма = Баланс - Выборка.СуммаОстаток;
		
	КонецЕсли;

КонецПроцедуры
