

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры
&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	СуммаМес = Сумма/12;
	
	счПериод = Период.ДатаНачала;
	Пока счПериод <= Период.ДатаОкончания Цикл
		
		Док = Документы.ПлановаяОперация.СоздатьДокумент();
		Док.Дата 		= счПериод;
		Док.СтатьяДДС 	= СтатьяДДС;
		Док.Сумма		= СуммаМес;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Если УчитыватьИнфляцию Тогда
			СуммаМес = СуммаМес+(СуммаМес*0.002466);
		КонецЕсли;	
		счПериод = ДобавитьМесяц(счПериод, 1);
		
	КонецЦикла;

КонецПроцедуры
