&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПостановки) Тогда
		Объект.ДатаПостановки = ТекущаяДата();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаДостижения) Тогда
		Объект.ДатаДостижения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПостановкиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПостановки) Тогда
		Объект.ДатаПостановки = ТекущаяДата();
	КонецЕсли;
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДостиженияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаДостижения) ИЛИ Объект.ДатаДостижения < Объект.ДатаПостановки Тогда
		Объект.ДатаДостижения = ТекущаяДата();
	КонецЕсли;
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	КолВоДней = (Объект.ДатаДостижения - Объект.ДатаПостановки)/86400;
	Объект.СуммаСИнфляцией = Объект.Сумма * pow((1+0.03/365),КолВоДней);
	
	РассчитатьСуммуСИнфляцией();
	
КонецПроцедуры
&НаКлиенте
Процедура РассчитатьСуммуСИнфляцией()
	
	КолВоДней = (Объект.ДатаДостижения - Объект.ДатаПостановки)/86400;
	Объект.СуммаСИнфляцией = Объект.Сумма * pow((1+0.03/365),КолВоДней);
	
КонецПроцедуры

