
Процедура ПриЗаписи(Отказ)
	
	НЗ = РегистрыСведений.ДостижениеЦелей.СоздатьНаборЗаписей();
	НЗ.Отбор.Цель.Установить(Ссылка);
	
	СуммаНакопительно = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"	, ДатаПостановки);
	Запрос.УстановитьПараметр("КонецПериода"	, ДатаДостижения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|ГДЕ
		|	Календарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	ТЗ = Запрос.Выполнить().Выгрузить();
	СуммаСИнфляциейВМесяц = СуммаСИнфляцией/ТЗ.Количество();
	
	Для каждого Стр Из ТЗ Цикл
		
		СуммаНакопительно = СуммаНакопительно + СуммаСИнфляциейВМесяц;
		
		СтрНЗ = НЗ.Добавить();
		СтрНЗ.Период 	= Стр.Период;
		СтрНЗ.Цель 		= Ссылка;
		СтрНЗ.Сумма 	= СуммаСИнфляциейВМесяц;
		СтрНЗ.СуммаНакопительно	= СуммаНакопительно;
		
	КонецЦикла;
	НЗ.Записать();

КонецПроцедуры
