
Процедура ПередЗаписью(Отказ)

	Если Валюта = Перечисления.Валюта.USD И СуммаВВалюте <> 0 Тогда
		Сумма = СуммаВВалюте * Курс;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СтатьяДДС.Тип = Перечисления.ПриходРасход.Приход Тогда
		ВидДвижения 	= ВидДвиженияНакопления.Приход;
	Иначе
		ВидДвижения 	= ВидДвиженияНакопления.Расход;
	КонецЕсли;

	Движения.ПлановыеДвижения.Записывать = Истина;
	Движение 				= Движения.ПлановыеДвижения.Добавить();
	Движение.ВидДвижения 	= ВидДвижения;
	Движение.Период 		= Дата;
	Движение.СтатьяДДС 		= СтатьяДДС;
	Движение.Сумма 			= Сумма;

КонецПроцедуры
