
Процедура ПередЗаписью(Отказ)

	Если ЗначениеЗаполнено(Валюта) Тогда
		СуммаВОсновнойВалюте = ЛФПСервер.КонвертироватьВОсновнуюВалюту(Сумма, Валюта, Дата);
	Иначе
		СуммаВОсновнойВалюте = Сумма;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если СтатьяДДС.Тип = Перечисления.ПриходРасход.Приход Тогда
		ВидДвижения 	= ВидДвиженияНакопления.Приход;
	Иначе
		ВидДвижения 	= ВидДвиженияНакопления.Расход;
	КонецЕсли;

	Движения.ПлановыеДвижения.Записывать = Истина;
	Движение 					= Движения.ПлановыеДвижения.Добавить();
	Движение.ВидДвижения 		= ВидДвижения;
	Движение.Период 			= Дата;
	Движение.СтатьяДДС 			= СтатьяДДС;
	Движение.Валюта				= Валюта;
	Движение.Сумма 				= Сумма;
	Движение.СуммаВОсновнойВалюте	= СуммаВОсновнойВалюте;

КонецПроцедуры
